export const memos = [
    {
        id: 1,
        date: '2023-02-07 10:00:00',
        title: 'React入門',
        content: 'Reactは、ユーザインターフェースを構築するための人気のあるJavaScriptライブラリで、特にシングルページアプリケーションに使用されます。Webアプリとモバイルアプリのビューレイヤーの管理に使用されます。'
    },
    {
        id: 2,
        date: '2023-03-12 12:00:00',
        title: 'Reactコンポーネント',
        content: 'コンポーネントは、Reactアプリケーションの基本的な構成要素で、一つのアプリは通常、複数のコンポーネントから構成されます。コンポーネントは基本的にユーザインターフェースの一部です。'
    },
    {
        id: 3,
        date: '2023-04-21 14:00:00',
        title: 'Reactの状態管理',
        content: 'Reactでは、状態とは時間経過によって変化し、アプリの振る舞いに影響を与えるデータを指します。状態はコンポーネント内で管理され、親コンポーネントから子コンポーネントに渡すことができます。'
    },
    {
        id: 4,
        date: '2023-05-03 16:00:00',
        title: 'React Hooks',
        content: 'React Hooksは、関数コンポーネントからReactの状態とライフサイクル機能を利用できるようにする関数です。'
    },
    {
        id: 5,
        date: '2023-06-10 17:00:00',
        title: 'React Context',
        content: 'Contextは、コンポーネントツリーを通じてデータを渡す方法を提供します。これにより、すべてのレベルで手動でpropsを渡す必要がなくなります。'
    },
    {
        id: 6,
        date: '2023-07-24 18:00:00',
        title: 'React Router',
        content: 'React Routerは、アプリケーションと宣言的に合成するナビゲーションコンポーネントの集合です。'
    },
    {
        id: 7,
        date: '2023-08-06 20:00:00',
        title: 'React Redux',
        content: 'Reduxは、JavaScriptアプリケーションのための予測可能な状態コンテナです。それは一貫性のある振る舞いを持つアプリケーションを作成するのを助け、異なる環境（クライアント、サーバー、ネイティブ）で実行でき、テストが容易です。'
    },
    {
        id: 8,
        date: '2023-09-15 21:00:00',
        title: 'Reactテスト',
        content: 'Reactでのテストは厳格で簡単です。これを行う最も人気のある選択肢は、Facebookが作成したテストランナーであるJestです。'
    },
    {
        id: 9,
        date: '2023-10-27 22:00:00',
        title: 'Reactパフォーマンス',
        content: 'パフォーマンスは機能です。これには、メモ化のようなReactパフォーマンス最適化が含まれます。'
    },
    {
        id: 10,
        date: '2023-11-05 23:00:00',
        title: 'Reactのベストプラクティス',
        content: 'Reactのベストプラクティスとは、効率的にタスクを達成し、バグが少ない方法やパターンを指します。'
    }
];